app/controllers/faculty_members_controller.rb

  def my_evaluations
    @id = current_faculty_member.id # need to remove this and put it in a before_filter with authentication
    @faculty = FacultyMember.find_by(id: @id)
    @evaluations = Evaluation.where(faculty_id: @faculty.id)
    @student_eval_dict = {}
    @evaluations.each do |eval|
      puts eval.student_id
      puts eval.faculty_id
      @student = Student.find(eval.student_id)
---
SELECT  "faculties".* FROM "faculties" WHERE "faculties"."id" IS NULL LIMIT ?  [["LIMIT", 1]]