app/controllers/faculty_members_controller.rb

SELECT  "faculty_members".* FROM "faculty_members" WHERE "faculty_members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def faculty_profile
    @faculty = FacultyMember.find_by(id: session[:faculty_id])

SELECT  "faculty_members".* FROM "faculty_members" WHERE "faculty_members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def faculty_evaluations
    faculty = FacultyMember.find_by(id: session[:faculty_id])
    student_eval = Student.find_by(id: session[:selected_student_id])

SELECT  "faculty_members".* FROM "faculty_members" WHERE "faculty_members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def my_evaluations
    faculty = FacultyMember.find_by(id: session[:faculty_id])