app/controllers/main_controller.rb

SELECT  "faculties".* FROM "faculties" WHERE "faculties"."email" = ? LIMIT 1  [["email", "student2@gmail.com"]]
---
  def intermediate_login
    given_email= params[:user][:email]

    @student = Student.where(email: given_email).take
    @faculty = Faculty.where(email: given_email).take