app/controllers/main_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."student_id" = ? LIMIT 1  [["student_id", 2]]
---
  def view_profile
    puts "View Profile"
    puts session[:user_type]
    @student = Student.where(id: session[:student_id]).take
    @current_profile = Profile.where(student_id: session[:student_id]).take

SELECT  "students".* FROM "students" WHERE "students"."email" = ? LIMIT 1  [["email", "jimmy@gmail.com"]]
---
  def intermediate_sign_up
    @student = Student
    @profile= Profile

    puts params[:user]
    missing=false
    if Student.where(:email => (params[:user][:email])).exists? || FacultyMember.where(:email => (params[:user][:email])).exists?

INSERT INTO "faculties" ("first_name", "last_name", "email", "password_digest") VALUES (?, ?, ?, ?)  [["first_name", "faculty"], ["last_name", "asd"], ["email", "f@gmail.com"], ["password_digest", "sdf"]]
---
        faculty={:first_name => params[:user][:first_name], :last_name => params[:user][:last_name],
                 :email => params[:user][:email],:password_digest=>params[:user][:password],
                         :university=>params[:uni], :department_id=> params[:dept]}
      FacultyMember.create!(faculty)

INSERT INTO "students" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "test"], ["last_name", "tester"], ["email", "t@gmail.com"], ["password_digest", "asd"], ["created_at", "2022-11-10 02:26:58.679541"], ["updated_at", "2022-11-10 02:26:58.679541"]]
---
              :email => params[:user][:email],:password_digest=>params[:user][:password],
        }

        Student.create!(student)

INSERT INTO "profiles" ("student_id") VALUES (?)  [["student_id", 11]]
---
                         :interested_major => nil, :term => nil,
                         :year =>nil }

        Profile.create!(student_profile)

SELECT  "students".* FROM "students" WHERE "students"."email" = ? LIMIT 1  [["email", "student2@gmail.com"]]
---
  def intermediate_login
    given_email= params[:user][:email]
    given_password = params[:user][:password]
    @student = Student.find_by(email:given_email,password_digest:given_password)